/****************************************************************************
* 文 件 名: main.c
* 描    述: 定时器T1通过中断方式控制LED3周期性闪烁
****************************************************************************/
#include <ioCC2530.h>

typedef unsigned char uchar;
typedef unsigned int  uint;

#define LED1 P1_0       // P1.0口控制LED1
#define LED2 P1_1       // P1.1口控制LED2
#define LED3 P1_4       // P1.4口控制LED3

//===修改
#define KEY1 P0_1       // P0.1口控制按键KEY1
#define KEY3 P0_7       // P0.7口控制按键KEY3
unsigned char keybuf1 = 0xFF; //连续8次的按键状态
unsigned char keybuf3 = 0xFF; //连续8次的按键状态
unsigned char KeyValue1=1;
unsigned char KeyValue3=0;//非常重要：初始时设定LED3闪烁，LED1熄灭效果
unsigned char LED=0;

unsigned short t1_count=0; //Timer1溢出次数计数
//===修改
/****************************************************************************
* 名    称: InitLed()
* 功    能: 设置LED灯相应的IO口
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
void InitLed(void)
{
    P1DIR |= 0x13;      //P1.0, P1.1, P1.4定义为输出
    LED1 = 0;           //使LED1灯上电默认为熄灭  
    LED2 = 0;           //使LED2灯上电默认为熄灭  
    LED3 = 0;           //使LED3灯上电默认为熄灭     
}

/****************************************************************************
* 名    称: InitT1()
* 功    能: 定时器初始化，系统不配置工作时钟时默认为16MHz
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
//===修改
void InitT1()
{
      T1CTL |= 0x00; //1分频
      //每隔0.002s会产生一个中断请求
      T1CC0L=0x3e;      //设置最大计数数值的低8位。
      T1CC0H=0x80;     //设置最大计数数值的高8位。
      T1OVFIM =1;  //使能定时器1溢出中断，可不写
      T1IE = 1;          //使能定时器1中断
      EA = 1;  //开全局中断
      T1CTL |= 0x03; //设置Up/down模式，计数开始    
}

/****************************************************************************
* 定时器T1中断处理函数
****************************************************************************/
#pragma vector=T1_VECTOR
__interrupt void T1_INT(void)
{
   T1STAT &= ~0x20;         //清除定时器1溢出中断标志位
   //IRCON = 0; //清除Timer中断标志 T1IF，可不写, 由硬件自动清零
   //T1IF=0;
   
   //==================按键检测部分==================//
   keybuf1 = (keybuf1<<1) | KEY1; //缓冲区左移一位，并将当前扫描值移入最低位
   keybuf3 = (keybuf3<<1) | KEY3; //缓冲区左移一位，并将当前扫描值移入最低位
   
   if (keybuf1 == 0x00)
   { //连续8次扫描值都为0可认为按键已按下
      KeyValue1=0;
   }
   else if (keybuf1 == 0xFF)
   { //连续8次扫描值都为1可认为按键已弹起
      KeyValue1=1;
   }
   else ;
   
   if (keybuf3 == 0x00)
   { //连续8次扫描值都为0可认为按键已按下
      KeyValue3=0;
   }
   else if (keybuf3 == 0xFF)
   { //连续8次扫描值都为1可认为按键已弹起
      KeyValue3=1;
   }
   else ;
   
   //================LED计时闪烁部分==================//
   t1_count++;         //定时器1溢出次数加1，溢出周期为0.002s
   if(t1_count ==750)   //如果溢出次数达到750说明经过了1.5s
   { 
     LED=1;    //点亮LED
   }
   else if( t1_count >=1000)   //如果溢出次数达到1000说明经过了2s
   {
       LED=0;    //熄灭LED
       t1_count=0;    //清零定时器1溢出次数              
   }
}


/****************************************************************************
* 程序入口函数
****************************************************************************/
void main(void)
{ 
    unsigned char backup1 = 1;
    unsigned char backup3 = 1;
 
  InitLed();  //调用LED初始化函数
    InitT1();   //调用Timer1初始化函数

    while(1)//初始时设定LED3闪烁，LED1熄灭
    {
        if(KeyValue1 != backup1) 
        {
          if(backup1 == 0) // 按键KEY1按下一次
          {
             while(KeyValue1&KeyValue3)
             {
                LED1=LED; //下一次按键事件未发生前：LED1闪烁，LED3熄灭
                LED3=0;
             }
          }
            backup1 = KeyValue1;
        }
        
       if(KeyValue3 != backup3) 
        {
          if(backup3 == 0)  // 按键KEY3按下一次
          {
            while(KeyValue1&KeyValue3)
             {
                LED3=LED; //下一次按键事件未发生前：LED1闪烁，LED3熄灭
                LED1=0;
             }
          }
            backup3 = KeyValue3;
        }
        
    }
}

//===修改
