#include <ioCC2530.h>

typedef unsigned char uchar;
typedef unsigned int  uint;
typedef unsigned long ulong;

#define LED1 P1_0       //P1.0口控制LED1
#define LED3 P1_4       //P1.4口控制LED3
#define KEY3 P0_7       // P0.1口控制KEY3

/****************************************************************************
* 名    称: DelayMS()
* 功    能: 以毫秒为单位延时 16M时约为535,系统时钟不修改默认为16M 
* 入口参数: msec 延时参数，值越大，延时越久
* 出口参数: 无
****************************************************************************/
void DelayMS(uint msec)
{ 
    uint i,j;
    
    for (i=0; i<msec; i++)
        for (j=0; j<535; j++);
}
/****************************************************************************
* 名    称: InitLed()
* 功    能: 设置LED灯相应的IO口
****************************************************************************/
void InitLed(void)
{
    P1DIR |= 0x01;           //P1.0定义为输出口
    P1DIR |= 0x10;           //P1.4定义为输出口
    LED1 = 0;                //LED1灯上电默认为熄灭 
    LED3 = 0;                //LED3灯上电默认为熄灭 
}
/****************************************************************************
* 名    称: SysPowerMode()
* 功    能: 设置系统工作模式
* 入口参数: mode等于0为PM0 1为PM1 2为PM2 3为PM3             
* 出口参数: 无
****************************************************************************/
void SysPowerMode(uchar mode) 
{ 
    if(mode < 4) 
    {  
        SLEEPCMD &= 0xFC;    //SLEEPCMD.MODE清零
        SLEEPCMD |= mode;    //设置系统睡眠模式 
        PCON = 0x01;         //进入睡眠模式 ,通过中断唤醒
    } 
    else 
        PCON = 0x00;         //通过中断唤醒系统 
}
/****************************************************************************
* 名    称: InitKey()
* 功    能: 设置KEY相应的IO口，采用中断方式 
****************************************************************************/
void InitKey()
{   
  P0SEL &= ~0x80;     //设置P0.7为普通IO口  
  P0DIR &= ~0x80;     //按键接在P0.7口上，设P0.7为输入模式 
  P0INP &= ~0x80;     //打开P0.7上拉电阻 
  
  P0IEN |= 0x80;      // P0.7 设置为中断方式 
  PICTL |= 0x01;      // 下降沿触发  
  //IEN1 |= 0x20;     // 允许P0口中断:P0中断使能位为 IEN1 的bit5
  P0IE = 1;           // 允许P0口中断;
  P0IFG = 0x00;       // 初始化中断标志位
  
  EA = 1; 
}

/****************************************************************************
* 名    称: P0_ISR(void) 中断处理函数 
* 描    述: #pragma vector = 中断向量，紧接着是中断处理程序
****************************************************************************/
#pragma vector = P0INT_VECTOR    
__interrupt void P0_ISR(void) 
{ 
    if( P0IFG & 0x80 )          //按键P0.7中断
    {
      DelayMS(10);       //延时去抖     
       if(KEY3==0)       
       {
           SysPowerMode(4);   //进入正常工作模式
       }  
    } 
    
    P0IFG &= ~ 0x80;        //清Pin0.1中断标志
    P0IF = 0;              //清端口0中断标志
} 
//修改

/****************************************************************************
* 程序入口函数
****************************************************************************/
void main(void)
{   
    uchar i=0;  
    
    InitLed();             //设置LED灯相应的IO口
    InitKey();             //设置KEY相应的IO口
    while(1)
    {
        for (i=0; i<6; i++)  //LED闪烁3次提醒用户将进入睡眠模式
        {
            LED3 = ~LED3;
            DelayMS(500);
        }
        SysPowerMode(3);    //进入睡眠模式PM3
        
        //以下是验证睡眠状态的语句
        LED1=1;             //如果正确进入睡眠模式PM3，LED1应该在发生外部中断后再点亮
        DelayMS(10);        
        LED1=0;             //如果通过外部中断正确唤醒，LED1应短暂亮起，随后LED3闪烁
    }
}
